testsuite_results/sysbench/results/oltp_update_non_index.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 8320.26 qps: 8320.26 (r/w/o: 0.00/8320.26/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 8443.81 qps: 8443.81 (r/w/o: 0.00/8443.81/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 8452.00 qps: 8452.00 (r/w/o: 0.00/8452.00/0.00) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           508670
        other:                           0
        total:                           508670
    transactions:                        508670 (8474.93 per sec.)
    queries:                             508670 (8474.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      8474.9317
    time elapsed:                        60.0207s
    total number of events:              508670

Latency (ms):
         min:                                    3.18
         avg:                                   15.10
         max:                                   50.43
         95th percentile:                       17.95
         sum:                              7680661.26

Threads fairness:
    events (avg/stddev):           3973.6172/8.94
    execution time (avg/stddev):   60.0052/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 8633.78 qps: 8633.78 (r/w/o: 0.00/8633.78/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 8642.25 qps: 8642.25 (r/w/o: 0.00/8642.25/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 8649.10 qps: 8649.10 (r/w/o: 0.00/8649.10/0.00) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           519499
        other:                           0
        total:                           519499
    transactions:                        519499 (8654.73 per sec.)
    queries:                             519499 (8654.73 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      8654.7275
    time elapsed:                        60.0250s
    total number of events:              519499

Latency (ms):
         min:                                    3.59
         avg:                                   14.79
         max:                                   46.27
         95th percentile:                       17.63
         sum:                              7682698.51

Threads fairness:
    events (avg/stddev):           4058.5859/23.67
    execution time (avg/stddev):   60.0211/0.00